ms-dotnettools.vscode-dotnet-runtime
lihuiwang.vue-alias-skip
formulahendry.auto-complete-tag
jeff-hykin.better-cpp-syntax
aaron-bond.better-comments
alefragnani.Bookmarks
ms-vscode.cpptools
hars.CppSnippets
MS-CEINTL.vscode-language-pack-zh-hans
xaver.clang-format
twxs.cmake
zchrissirhcz.cmake-highlight
josetr.cmake-language-support-vscode
cheshirekow.cmake-format
formulahendry.code-runner
vadimcn.vscode-lldb
adpyke.codesnap
in4margaret.compareit
disroop.conan
WallabyJs.console-ninja
marus25.cortex-debug
be5invis.vscode-custom-css
mcu-debug.debug-tracker-vscode
fill-labs.dependi
plorefice.devicetree
cschlosser.doxdocgen
shadowndacorner.vscode-easymotion
kahole.magit
usernamehw.errorlens
dbaeumer.vscode-eslint
espressif.esp-idf-extension
tamasfe.even-better-toml
FittenTech.Fitten-Code
donjayamanne.githistory
GitHub.copilot
eamodio.gitlens
golang.go
ms-vscode.hexeditor
kisstkondoros.vscode-gutter-preview
oderwat.indent-rainbow
JimmyZJX.leaderkey
ritwickdey.LiveServer
yzhang.markdown-all-in-one
mcu-debug.memory-view
ddiu8081.moegi-theme
Llam4u.nerdtree
esbenp.prettier-vscode
IBM.output-colorizer
vscodevim.vim
mcaragheorghe.vim-enhanced
jonatanbakucz.vim-status-bar
